{
  "backend/main.mo": "Implements authorization, user profile storage, contact form submission handling, and authenticated retrieval of sorted submissions.",
  "feature_evidence.json": "Lists features, associated files, components, and test IDs used for project feature tracking.",
  "frontend-file-summaries.txt": "Provides short descriptions of all major frontend files for reference during build planning.",
  "frontend/index.css": "Defines global Tailwind styles and OKLCH design tokens for light/dark themes.",
  "frontend/index.html": "HTML entry point loading the React app into the root container.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and provides the global router provider.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button integrating Internet Identity with loading and error handling.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Mandatory dialog for new users to submit their display name via a profile save mutation.",
  "frontend/src/components/contact/ContactForm.tsx": "Client-side validated contact form that submits data to the backend and shows success feedback.",
  "frontend/src/components/layout/Footer.tsx": "Renders the site footer with company info, quick links, contact details, and a caffeine.ai attribution link.",
  "frontend/src/components/layout/Header.tsx": "Implements the site header with logo, navigation, login button, and responsive mobile menu.",
  "frontend/src/components/layout/SiteLayout.tsx": "Defines the main page layout including header, footer, and routed content outlet.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, logout, and identity initialization.",
  "frontend/src/hooks/usePageMeta.ts": "Updates the document title and meta description when a page loads.",
  "frontend/src/hooks/useQueries.ts": "Adds hooks to fetch and update the caller's user profile via the backend actor.",
  "frontend/src/hooks/useSubmissions.ts": "Fetches contact form submissions from the backend with a limit parameter.",
  "frontend/src/hooks/useSubmitContactForm.ts": "Provides a mutation hook to submit contact form data through the backend actor.",
  "frontend/src/index.css": "Defines global Tailwind CSS styles, color theme variables, and base typography.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers.",
  "frontend/src/pages/AboutPage.tsx": "Displays the About page with company story, mission, values, and supporting visuals.",
  "frontend/src/pages/ContactPage.tsx": "Renders the contact page with company contact details and a contact form, using page metadata hooks and styled sections.",
  "frontend/src/pages/HomePage.tsx": "Displays the homepage with a hero section, value propositions, and featured product highlights, including navigation actions.",
  "frontend/src/pages/InboxPage.tsx": "Shows authenticated users a list of contact form submissions with loading, error, and profile-setup handling.",
  "frontend/src/pages/ProductsPage.tsx": "Lists product categories with descriptions and items, generating a grid of product cards and setting page metadata.",
  "frontend/src/pages/ServicesPage.tsx": "Presents a grid of IT service offerings with icons, descriptions, and feature lists, along with page metadata setup.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read, store, and clear URL and session parameters, supporting both query strings and hash-based routing.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, spacing, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Describes the project’s current state, including features, requirements, image assets, and metadata for the SGS Solutions website build."
}